DELETE FROM cities;
DELETE FROM cars;
DELETE FROM persons;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO cities (name)
VALUES ('Новосибирск'),
       ('Томск'),
       ('Кемерово'),
       ('Омск'),
       ('Барнаул'),
       ('Горно-Алтайск'),
       ('Красноярск'),
       ('Новокузнецк'),
       ('Иркутск'),
       ('Улан-Удэ');

INSERT INTO persons (first_name, last_name, patronymic, city_id)
VALUES ('Юлий', 'Гаврилов', 'Адольфович',100000),
       ('Адольф', 'Костин', 'Глебович',100001),
       ('Захар', 'Мясников', 'Феликсович',100002),
       ('Клемент', 'Бобылёв', 'Двумашинович',100003),
       ('Ким', 'Ковалёв', 'Натанович',100004),
       ('Алан', 'Пономарёв', 'Борисович',100005),
       ('Фрол', 'Русаков', 'Куприянович',100006),
       ('Арсен', 'Громов', 'Куприянович',100007),
       ('Вальтер', 'Буров', 'Мэлсович',100008),
       ('Гордей', 'Андреев', 'Безмашинович',100008);

INSERT INTO cars (person_id, model, license)
VALUES (100010, 'BMW X6', 'а842во43'),
       (100011, 'Daewoo nexia', 'е382см48'),
       (100012, 'Porsche Cayenne', 'х295рн39'),
       (100013, 'BMW X5', 'в204ек23'),
       (100013, 'Toyota Crown', 'н240мн34'),
       (100014, 'Nissan Patrol', 'м824мн77'),
       (100015, 'Honda Accord', 'к555кк177'),
       (100016, 'УАЗ Патриот', 'у683ат38'),
       (100017, 'Volvo XC90', 'у840см54'),
       (100018, 'Lexus LX430', 'х510то54')
;